ksekimoto/llvm-project/llvm/lib/Target/RL78/RL78FrameLowering.cpp
//===-- RL78FrameLowering.cpp - RL78 Frame Information ------------------===//
//
// Part of the LLVM Project, under the Apache License v2.0 with LLVM Exceptions.
// See https://llvm.org/LICENSE.txt for license information.
// SPDX-License-Identifier: Apache-2.0 WITH LLVM-exception
//
//===----------------------------------------------------------------------===//
//
// This file contains the RL78 implementation of TargetFrameLowering class.
//
//===----------------------------------------------------------------------===//

#include "RL78Subtarget.h"
// #include "llvm/CodeGen/MachineFrameInfo.h"
// #include "llvm/CodeGen/MachineModuleInfo.h"
#include "llvm/Support/TypeSize.h"
#include "llvm/CodeGen/MachineFrameInfo.h"
#include "llvm/CodeGen/MachineFunction.h"
#include "llvm/CodeGen/MachineInstrBuilder.h"
#include "llvm/CodeGen/MachineRegisterInfo.h"
#include "llvm/CodeGen/RegisterScavenging.h"
#include "llvm/IR/DiagnosticInfo.h"
#include "llvm/MC/MCDwarf.h"

using namespace llvm;

static uint32_t getCSRegisterInfo(MachineFunction &MF) {
  uint32_t mask = ~0U;
  unsigned int sizeof_mask = CHAR_BIT * sizeof(mask);
  unsigned regNo;
  const TargetRegisterInfo *TRI =
      MF.getSubtarget<RL78Subtarget>().getRegisterInfo();
  // If a call is present we need to save/restore all registers.
  if (MF.getFrameInfo().hasCalls()) {
    mask = mask >> (sizeof_mask - (RL78::RP6 - RL78::RP0 + 1));
  } else {
    // Mark used regs.
    mask = 0;
    for (regNo = RL78::RP0; regNo < RL78::RP8; ++regNo) {
      if (!MF.getRegInfo().reg_empty(regNo) ||
          !MF.getRegInfo().reg_empty(TRI->getSubReg(regNo, RL78::sub_lo)) ||
          !MF.getRegInfo().reg_empty(TRI->getSubReg(regNo, RL78::sub_hi)))

        mask |= 1 << (regNo - RL78::RP0);
    }
  }

  regNo = RL78::RP8 - RL78::RP0;
  if (!MF.getRegInfo().reg_empty(RL78::CS) || MF.getFrameInfo().hasCalls())
    mask |= 1 << regNo;

  regNo++;
  if (!MF.getRegInfo().reg_empty(RL78::ES) || MF.getFrameInfo().hasCalls())
    mask |= 1 << regNo;

  return mask;
}

RL78FrameLowering::RL78FrameLowering(const RL78Subtarget &ST)
    : TargetFrameLowering(TargetFrameLowering::StackGrowsUp, Align(2), 0) {}

void RL78FrameLowering::emitPrologue(MachineFunction &MF,
                                     MachineBasicBlock &MBB) const {
  const RL78Subtarget &Subtarget = MF.getSubtarget<RL78Subtarget>();
  MachineFrameInfo &MFI = MF.getFrameInfo();
  const RL78InstrInfo &TII =
      *static_cast<const RL78InstrInfo *>(MF.getSubtarget().getInstrInfo());
  // ToDo: Fix
  // const RL78RegisterInfo &RegInfo = *static_cast<const RL78RegisterInfo *>(
  //     MF.getSubtarget().getRegisterInfo());
  MachineBasicBlock::iterator MBBI = MBB.begin();
  SmallVector<unsigned, 4> CSR;
  // Debug location must be unknown since the first debug location is used
  // to determine the end of the prologue.
  DebugLoc dl;
  // ToDo: Fix
  // bool NeedsStackRealignment = RegInfo.needsStackRealignment(MF);
  bool NeedsStackRealignment = true;

  // Get the number of bytes to allocate from the FrameInfo
  // TODO: if we are using FP, we are wasting stack here, since we will
  // reallocate stack for parameter passing before each call. So maybe we could
  // decrease this initial allocation by the max space allocated for function
  // calls?
  unsigned NumBytes = (int)MFI.getStackSize();

  // Align the stack size (2).
  if (NumBytes & 1) // TODO: is it even possible to have odd stack size? replace
                    // with assert?
    NumBytes++;

  unsigned NumBytesForCSRegs = 0;
  if (MF.getFunction().hasFnAttribute("brk_interrupt") ||
      MF.getFunction().hasFnAttribute("interrupt")) {
    uint64_t Specs;

    if (MF.getFunction().hasFnAttribute("interrupt")) {
      StringRef SpecsstringInterrupt =
          MF.getFunction().getFnAttribute("interrupt").getValueAsString();
      size_t HasVect = SpecsstringInterrupt.find("Vect_");
      if (HasVect != std::string::npos)
        SpecsstringInterrupt.substr(0, HasVect).getAsInteger(0, Specs);
      else
        SpecsstringInterrupt.getAsInteger(0, Specs);
    } else {
      MF.getFunction()
          .getFnAttribute("brk_interrupt")
          .getValueAsString()
          .getAsInteger(0, Specs);
    }
    // Bit 10 representes nested interrupts.

    if (Specs & 0x8)
      BuildMI(MBB, MBBI, dl, TII.get(RL78::EI));
    // Bits 0, 1 and 2 represent the regiter bank:
    // 0 is a register bank was specified
    // 1,2 the bank number: 0/1/2/3.
    unsigned Bank = Specs & 0x7;

    if (Subtarget.isRL78S1CoreType() && Bank) {
      report_fatal_error("Bank selection is not supported for S1 core type");
    }

    uint32_t mask = getCSRegisterInfo(MF);
    // If we use the bank= specification.
    if (Bank) {
      // When no register is used or no function is called in an interrupt
      // handler, the instruction for switching register banks is not output
      // even if register bank switching is specified
      if (mask || MFI.hasCalls())
        BuildMI(MBB, MBBI, dl, TII.get(RL78::SEL)).addImm(Bank >> 1);
    } else {
      for (unsigned reg = 0; reg < 4; ++reg) {
        if ((1 << reg) & mask) {
          BuildMI(MBB, MBBI, dl, TII.get(RL78::PUSH_rp))
              .addReg(RL78::RP0 + (reg % 4));
          NumBytesForCSRegs += 2;
          unsigned CFIIndex =
              MF.addFrameInst(MCCFIInstruction::cfiDefCfaOffset(
                  nullptr, -NumBytesForCSRegs - 4));
          BuildMI(MBB, MBBI, dl, TII.get(TargetOpcode::CFI_INSTRUCTION))
              .addCFIIndex(CFIIndex);
        }
      }
    }
    if (mask & (1 << 5) && mask & (1 << 4)) {
      BuildMI(MBB, MBBI, dl, TII.get(RL78::MOV_A_cs), RL78::R1)
          .addReg(RL78::CS);
      BuildMI(MBB, MBBI, dl, TII.get(RL78::MOV_r_A), RL78::R0).addReg(RL78::R1);
      BuildMI(MBB, MBBI, dl, TII.get(RL78::MOV_A_es), RL78::R1)
          .addReg(RL78::ES);
      BuildMI(MBB, MBBI, dl, TII.get(RL78::PUSH_rp)).addReg(RL78::RP0);
      NumBytesForCSRegs += 2;
      unsigned CFIIndex = MF.addFrameInst(MCCFIInstruction::cfiDefCfaOffset(
          nullptr, -NumBytesForCSRegs - 4));
      BuildMI(MBB, MBBI, dl, TII.get(TargetOpcode::CFI_INSTRUCTION))
          .addCFIIndex(CFIIndex);
    } else {
      if (mask & (1 << 4)) {
        BuildMI(MBB, MBBI, dl, TII.get(RL78::MOV_A_cs), RL78::R1)
            .addReg(RL78::CS);
        BuildMI(MBB, MBBI, dl, TII.get(RL78::PUSH_rp)).addReg(RL78::RP0);
        NumBytesForCSRegs += 2;
        unsigned CFIIndex =
            MF.addFrameInst(MCCFIInstruction::cfiDefCfaOffset(
                nullptr, -NumBytesForCSRegs - 4));
        BuildMI(MBB, MBBI, dl, TII.get(TargetOpcode::CFI_INSTRUCTION))
            .addCFIIndex(CFIIndex);
      }
      if (mask & (1 << 5)) {
        BuildMI(MBB, MBBI, dl, TII.get(RL78::MOV_A_es), RL78::R1)
            .addReg(RL78::ES);
        BuildMI(MBB, MBBI, dl, TII.get(RL78::PUSH_rp)).addReg(RL78::RP0);
        NumBytesForCSRegs += 2;
        unsigned CFIIndex =
            MF.addFrameInst(MCCFIInstruction::cfiDefCfaOffset(
                nullptr, -NumBytesForCSRegs - 4));
        BuildMI(MBB, MBBI, dl, TII.get(TargetOpcode::CFI_INSTRUCTION))
            .addCFIIndex(CFIIndex);
      }
    }
  }

  // Update stack size with corrected value.
  if (NeedsStackRealignment) {
    // Reserve a slot for the old sp.
    NumBytes += 2;
    // Save AX, to be restored after we are done aligning.
    BuildMI(MBB, MBBI, dl, TII.get(RL78::PUSH_rp)).addReg(RL78::RP0);
  }

