ksekimoto/llvm-project/llvm/lib/Target/RL78/RL78FrameLowering.cpp
  MFI.setStackSize(NumBytes + NumBytesForCSRegs);

  // Emit SUBW SP, #N.
  if (NumBytes > 0) {
    if (NumBytes == 2)
      BuildMI(MBB, MBBI, dl, TII.get(RL78::PUSH_rp)).addReg(RL78::RP0);
    else if (NumBytes < 0x100)
      BuildMI(MBB, MBBI, dl, TII.get(RL78::SUBW_sp_imm), RL78::SPreg)
          .addReg(RL78::SPreg)
          .addImm(NumBytes);
    else if (NumBytes < 0x1FC) {
      // TODO: we can do for 3 x SUBW as well if RP0 is used
      BuildMI(MBB, MBBI, dl, TII.get(RL78::SUBW_sp_imm), RL78::SPreg)
          .addReg(RL78::SPreg)
          .addImm(0xFE);
      BuildMI(MBB, MBBI, dl, TII.get(RL78::SUBW_sp_imm), RL78::SPreg)
          .addReg(RL78::SPreg)
          .addImm(NumBytes - 0xFE);
    } else if (NumBytes < 0x10000) {
      // TODO: check if RP0 is actually used i.e. the function has parameters.
      // BuildMI(MBB, MBBI, dl, TII.get(RL78::PUSH_rp))
      //    .addReg(RL78::RP0, RegState::Kill);
      BuildMI(MBB, MBBI, dl, TII.get(RL78::XCHW_AX_rp), RL78::RP0)
          .addReg(RL78::RP6, RegState::Define)
          .addReg(RL78::RP0, RegState::Kill)
          .addReg(RL78::RP6, RegState::Kill);
      BuildMI(MBB, MBBI, dl, TII.get(RL78::MOVW_rp_sp), RL78::RP0)
          .addReg(RL78::SPreg);
      BuildMI(MBB, MBBI, dl, TII.get(RL78::SUBW_rp_imm), RL78::RP0)
          .addReg(RL78::RP0)
          .addImm(NumBytes);
      BuildMI(MBB, MBBI, dl, TII.get(RL78::MOVW_sp_rp), RL78::SPreg)
          .addReg(RL78::RP0);
      BuildMI(MBB, MBBI, dl, TII.get(RL78::XCHW_AX_rp), RL78::RP0)
          .addReg(RL78::RP6, RegState::Define)
          .addReg(RL78::RP0, RegState::Kill)
          .addReg(RL78::RP6, RegState::Kill);
    }
    // Most RL78 devices just have a few KB of RAM,
    // the biggest RAM which I've seen on RL78 is 48 KB (R5F104xL) so well under
    // 64 KB (0x10000).
    else
      llvm_unreachable("Invalid stack allocation!");

    unsigned CFIIndex = MF.addFrameInst(MCCFIInstruction::cfiDefCfaOffset(
        nullptr, -(NumBytes + NumBytesForCSRegs) - 4));
    BuildMI(MBB, MBBI, dl, TII.get(TargetOpcode::CFI_INSTRUCTION))
        .addCFIIndex(CFIIndex);
  }

  if (NeedsStackRealignment) {
    // Save SP to HL.
    BuildMI(MBB, MBBI, dl, TII.get(RL78::MOVW_rp_sp), RL78::RP6)
        .addReg(RL78::SPreg);

    BuildMI(MBB, MBBI, dl, TII.get(RL78::MOVW_rp_sp), RL78::RP0)
        .addReg(RL78::SPreg);

    // Align to the requested boundary.
    Align MaxAlign = MFI.getMaxAlign();
    unsigned value = MaxAlign.value();
    unsigned alignment = (~(value - 1)) & 0xffff;
    if (value & 0xFF00)
      BuildMI(MBB, MBBI, dl, TII.get(RL78::AND_r_imm), RL78::R1)
          .addReg(RL78::R1)
          .addImm(alignment >> 8);

    BuildMI(MBB, MBBI, dl, TII.get(RL78::XCH_A_r), RL78::R1)
        .addReg(RL78::R0, RegState::Define)
        .addReg(RL78::R1, RegState::Kill)
        .addReg(RL78::R0, RegState::Kill);
    BuildMI(MBB, MBBI, dl, TII.get(RL78::AND_r_imm), RL78::R1)
        .addReg(RL78::R1)
        .addImm(alignment & 0xff);
    BuildMI(MBB, MBBI, dl, TII.get(RL78::XCH_A_r), RL78::R1)
        .addReg(RL78::R0, RegState::Define)
        .addReg(RL78::R1, RegState::Kill)
        .addReg(RL78::R0, RegState::Kill);

    // Change SP to the new aligned address.
    BuildMI(MBB, MBBI, dl, TII.get(RL78::MOVW_sp_rp), RL78::SPreg)
        .addReg(RL78::RP0, RegState::Kill);

    // Save the old sp just above the new stack start.
    BuildMI(MBB, MBBI, dl, TII.get(RL78::MOVW_AX_rp), RL78::RP0)
        .addReg(RL78::RP6);
    if (isUInt<8>(NumBytes)) {
      BuildMI(MBB, MBBI, dl, TII.get(RL78::STORE16_stack_slot_rp))
          .addReg(RL78::SPreg)
          .addImm(NumBytes - 2)
          .addReg(RL78::RP0, RegState::Kill);

      // Restore old ax value.
      BuildMI(MBB, MBBI, dl, TII.get(RL78::LOAD16_rp_rpi), RL78::RP0)
          .addReg(RL78::RP6, RegState::Kill)
          .addImm(NumBytes);

    } else if (isUInt<16>(NumBytes + 2)) {
      // Store using word[BC], save the old sp.
      BuildMI(MBB, MBBI, dl, TII.get(RL78::PUSH_rp))
          .addReg(RL78::RP2, RegState::Kill);
      BuildMI(MBB, MBBI, dl, TII.get(RL78::MOVW_rp_sp), RL78::RP2)
          .addReg(RL78::SPreg);
      BuildMI(MBB, MBBI, dl, TII.get(RL78::STORE16_rpi_rp))
          .addReg(RL78::RP2, RegState::Kill)
          .addImm(NumBytes)
          .addReg(RL78::RP0, RegState::Kill);

      // Restore old ax value.
      BuildMI(MBB, MBBI, dl, TII.get(RL78::MOVW_AX_rp), RL78::RP0)
          .addReg(RL78::RP6, RegState::Kill);
      BuildMI(MBB, MBBI, dl, TII.get(RL78::MOVW_rp_AX), RL78::RP2)
          .addReg(RL78::RP0, RegState::Kill);
      BuildMI(MBB, MBBI, dl, TII.get(RL78::LOAD16_rp_rpi), RL78::RP0)
          .addReg(RL78::RP2, RegState::Kill)
          .addImm(NumBytes);

      BuildMI(MBB, MBBI, dl, TII.get(RL78::POP_rp), RL78::RP2);
    } else
      llvm_unreachable("Invalid stack offset!");
  }

  if (hasFP(MF)) {
    // Update FP with the new base value...
    BuildMI(MBB, MBBI, dl, TII.get(RL78::MOVW_rp_sp), RL78::RP6)
        .addReg(RL78::SPreg);
    // Dwarf regnum of HL is 6.
    unsigned CFIIndex =
        MF.addFrameInst(MCCFIInstruction::createDefCfaRegister(nullptr, 6));
    BuildMI(MBB, MBBI, dl, TII.get(TargetOpcode::CFI_INSTRUCTION))
        .addCFIIndex(CFIIndex);

    // Mark the FramePtr as live-in in every block except the entry.
    for (MachineFunction::iterator I = std::next(MF.begin()), E = MF.end();
         I != E; ++I)
      I->addLiveIn(RL78::RP6);
  }
}

MachineBasicBlock::iterator RL78FrameLowering::eliminateCallFramePseudoInstr(
    MachineFunction &MF, MachineBasicBlock &MBB,
    MachineBasicBlock::iterator I) const {

  const RL78InstrInfo &TII =
      *static_cast<const RL78InstrInfo *>(MF.getSubtarget().getInstrInfo());

  int64_t Amount = I->getOperand(0).getImm();
  if (!hasFP(MF) || Amount == 0)
    return MBB.erase(I);

  const DebugLoc &DL = I->getDebugLoc();
  if (I->getOpcode() == TII.getCallFrameSetupOpcode()) {
    // allocate stack for parameter passing
    BuildMI(MBB, I, DL, TII.get(RL78::SUBW_sp_imm), RL78::SPreg)
        .addReg(RL78::SPreg)
        .addImm(Amount);
  } else {
    // deallocate stack used for parameter passing
    BuildMI(MBB, I, DL, TII.get(RL78::ADDW_sp_imm), RL78::SPreg)
        .addReg(RL78::SPreg)
        .addImm(Amount);
  }

  return MBB.erase(I);
}

void RL78FrameLowering::emitEpilogue(MachineFunction &MF,
                                     MachineBasicBlock &MBB) const {
  MachineBasicBlock::iterator MBBI = MBB.getLastNonDebugInstr();
  const RL78InstrInfo &TII =
      *static_cast<const RL78InstrInfo *>(MF.getSubtarget().getInstrInfo());
  DebugLoc dl = MBBI->getDebugLoc();
  // if (!FuncInfo->isLeafProc()) {
  //  return;
  //}
  MachineFrameInfo &MFI = MF.getFrameInfo();

  int NumBytes = (int)MFI.getStackSize();
  // if (NumBytes == 0)
  // return;

  if (hasFP(MF)) {
    // Restore SP from FP
    BuildMI(MBB, MBBI, dl, TII.get(RL78::XCHW_AX_rp), RL78::RP0)
        .addReg(RL78::RP6, RegState::Define)
        .addReg(RL78::RP0, RegState::Kill)
        .addReg(RL78::RP6, RegState::Kill);
    // Dwarf regnum of AX is 0.
    unsigned CFIIndex =
        MF.addFrameInst(MCCFIInstruction::createDefCfaRegister(nullptr, 0));
    BuildMI(MBB, MBBI, dl, TII.get(TargetOpcode::CFI_INSTRUCTION))
        .addCFIIndex(CFIIndex);

    BuildMI(MBB, MBBI, dl, TII.get(RL78::MOVW_sp_rp), RL78::SPreg)
        .addReg(RL78::RP0);
    // Dwarf regnum of SP is 32.
    CFIIndex =
        MF.addFrameInst(MCCFIInstruction::createDefCfaRegister(nullptr, 32));
    BuildMI(MBB, MBBI, dl, TII.get(TargetOpcode::CFI_INSTRUCTION))
        .addCFIIndex(CFIIndex);

    BuildMI(MBB, MBBI, dl, TII.get(RL78::XCHW_AX_rp), RL78::RP0)
        .addReg(RL78::RP6, RegState::Define)
        .addReg(RL78::RP0, RegState::Kill)
        .addReg(RL78::RP6, RegState::Kill);
  }

  unsigned NumBytesForCSRegs = 0;
  uint64_t Specs;
  uint32_t mask;
  unsigned Bank;

