ksekimoto/llvm-project/llvm/lib/Target/RL78/RL78FrameLowering.cpp
  if (MF.getFunction().hasFnAttribute("brk_interrupt") ||
      MF.getFunction().hasFnAttribute("interrupt")) {

    if (MF.getFunction().hasFnAttribute("interrupt")) {
      StringRef SpecsstringInterrupt =
          MF.getFunction().getFnAttribute("interrupt").getValueAsString();
      size_t HasVect = SpecsstringInterrupt.find("Vect_");
      if (HasVect != std::string::npos)
        SpecsstringInterrupt.substr(0, HasVect).getAsInteger(0, Specs);
      else
        SpecsstringInterrupt.getAsInteger(0, Specs);
    } else {
      MF.getFunction()
          .getFnAttribute("brk_interrupt")
          .getValueAsString()
          .getAsInteger(0, Specs);
    }
    // Bits 0, 1 and 2 represent the regiter bank:
    // 0 is a register bank was specified
    // 1,2 the bank number: 0/1/2/3.
    Bank = Specs & 0x7;
    // In case we use the bank= sepcification, we don't need to set the register
    // bank back to 0 becuase the the hardware does this automatically (RBS0 and
    // RBS1 bits are part of PSW register): "The data saved to the stack returns
    // to the PC and the PSW, and the program returns from the interrupt
    // servicing routine. "
    mask = getCSRegisterInfo(MF);

    if (mask & (1 << 5) && mask & (1 << 4)) {
      NumBytesForCSRegs += 2;
    } else {
      if (mask & (1 << 5))
        NumBytesForCSRegs += 2;
      if (mask & (1 << 4))
        NumBytesForCSRegs += 2;
    }

    if (!Bank) {
      for (unsigned reg = 4; reg > 0; --reg)
        if ((1 << (reg - 1)) & mask)
          NumBytesForCSRegs += 2;
    }
  }

  unsigned NumBytesAdjusted = NumBytes - NumBytesForCSRegs;

  // Restore the old SP.
  bool flag = false;
  // ToDo: Fix
  // const RL78RegisterInfo &RegInfo = *static_cast<const RL78RegisterInfo *>(
  //     MF.getSubtarget().getRegisterInfo());
  // if (RegInfo.needsStackRealignment(MF)) {
  if (flag) {
    BuildMI(MBB, MBBI, dl, TII.get(RL78::XCHW_AX_rp), RL78::RP0)
        .addReg(RL78::RP6, RegState::Define)
        .addReg(RL78::RP0, RegState::Kill)
        .addReg(RL78::RP6, RegState::Kill);

    if (isUInt<8>(NumBytesAdjusted - 2))
      BuildMI(MBB, MBBI, dl, TII.get(RL78::LOAD16_rp_stack_slot), RL78::RP0)
          .addReg(RL78::SPreg)
          .addImm(NumBytesAdjusted - 2);
    else if (isUInt<16>(NumBytesAdjusted)) {
      // Load using word[BC], restore the old sp.
      BuildMI(MBB, MBBI, dl, TII.get(RL78::PUSH_rp))
          .addReg(RL78::RP2, RegState::Kill);
      BuildMI(MBB, MBBI, dl, TII.get(RL78::MOVW_rp_sp), RL78::RP2)
          .addReg(RL78::SPreg);
      BuildMI(MBB, MBBI, dl, TII.get(RL78::LOAD16_rp_rpi), RL78::RP0)
          .addReg(RL78::RP2, RegState::Kill)
          .addImm(NumBytesAdjusted);
      BuildMI(MBB, MBBI, dl, TII.get(RL78::POP_rp), RL78::RP2);
    } else
      llvm_unreachable("Invalid stack offset!");

    BuildMI(MBB, MBBI, dl, TII.get(RL78::MOVW_sp_rp), RL78::SPreg)
        .addReg(RL78::RP0);
    BuildMI(MBB, MBBI, dl, TII.get(RL78::XCHW_AX_rp), RL78::RP0)
        .addReg(RL78::RP6, RegState::Define)
        .addReg(RL78::RP0, RegState::Kill)
        .addReg(RL78::RP6, RegState::Kill);
    // Free up the slot used to save AX in the prologue.
    NumBytesAdjusted += 2;
  }

  if (NumBytesAdjusted != 0) {
    // TODO: we can use  POP  in some cases (depending on ret value)
    // Emit ADDW SP, #N.
    if (NumBytesAdjusted < 0x100)
      BuildMI(MBB, MBBI, dl, TII.get(RL78::ADDW_sp_imm), RL78::SPreg)
          .addReg(RL78::SPreg)
          .addImm(NumBytesAdjusted);
    else if (NumBytesAdjusted < 0x1FC) {
      // TODO: we can do for 3 x ADDW as well if RP0 is used
      BuildMI(MBB, MBBI, dl, TII.get(RL78::ADDW_sp_imm), RL78::SPreg)
          .addReg(RL78::SPreg)
          .addImm(0xFE);
      BuildMI(MBB, MBBI, dl, TII.get(RL78::ADDW_sp_imm), RL78::SPreg)
          .addReg(RL78::SPreg)
          .addImm(NumBytesAdjusted - 0xFE);
    } else if (NumBytesAdjusted < 0x10000) {
      // TODO: check if RP0 is usesd
      BuildMI(MBB, MBBI, dl, TII.get(RL78::XCHW_AX_rp), RL78::RP0)
          .addReg(RL78::RP6, RegState::Define)
          .addReg(RL78::RP0, RegState::Kill)
          .addReg(RL78::RP6, RegState::Kill);
      BuildMI(MBB, MBBI, dl, TII.get(RL78::MOVW_rp_sp), RL78::RP0)
          .addReg(RL78::SPreg);
      BuildMI(MBB, MBBI, dl, TII.get(RL78::ADDW_rp_imm), RL78::RP0)
          .addReg(RL78::RP0)
          .addImm(NumBytesAdjusted);
      BuildMI(MBB, MBBI, dl, TII.get(RL78::MOVW_sp_rp), RL78::SPreg)
          .addReg(RL78::RP0);
      BuildMI(MBB, MBBI, dl, TII.get(RL78::XCHW_AX_rp), RL78::RP0)
          .addReg(RL78::RP6, RegState::Define)
          .addReg(RL78::RP0, RegState::Kill)
          .addReg(RL78::RP6, RegState::Kill);
    } else
      llvm_unreachable("Invalid stack allocation!");

    unsigned CFIIndex =
        MF.addFrameInst(MCCFIInstruction::cfiDefCfaOffset(nullptr, -4));
    BuildMI(MBB, MBBI, dl, TII.get(TargetOpcode::CFI_INSTRUCTION))
        .addCFIIndex(CFIIndex);
  }
  if (MF.getFunction().hasFnAttribute("brk_interrupt") ||
      MF.getFunction().hasFnAttribute("interrupt")) {
    if (mask & (1 << 5) && mask & (1 << 4)) {
      BuildMI(MBB, MBBI, dl, TII.get(RL78::POP_rp), RL78::RP0);
      BuildMI(MBB, MBBI, dl, TII.get(RL78::MOV_es_A), RL78::ES)
          .addReg(RL78::R1);
      BuildMI(MBB, MBBI, dl, TII.get(RL78::MOV_A_r), RL78::R1).addReg(RL78::R0);
      BuildMI(MBB, MBBI, dl, TII.get(RL78::MOV_cs_A), RL78::CS)
          .addReg(RL78::R1);
      NumBytes -= 2;
      unsigned CFIIndex = MF.addFrameInst(
          MCCFIInstruction::cfiDefCfaOffset(nullptr, -NumBytes - 4));
      BuildMI(MBB, MBBI, dl, TII.get(TargetOpcode::CFI_INSTRUCTION))
          .addCFIIndex(CFIIndex);
    } else {
      if (mask & (1 << 5)) {
        BuildMI(MBB, MBBI, dl, TII.get(RL78::POP_rp), RL78::RP0);
        BuildMI(MBB, MBBI, dl, TII.get(RL78::MOV_es_A), RL78::ES)
            .addReg(RL78::R1);
        NumBytes -= 2;
        unsigned CFIIndex = MF.addFrameInst(
            MCCFIInstruction::cfiDefCfaOffset(nullptr, -NumBytes - 4));
        BuildMI(MBB, MBBI, dl, TII.get(TargetOpcode::CFI_INSTRUCTION))
            .addCFIIndex(CFIIndex);
      }
      if (mask & (1 << 4)) {
        BuildMI(MBB, MBBI, dl, TII.get(RL78::POP_rp), RL78::RP0);
        BuildMI(MBB, MBBI, dl, TII.get(RL78::MOV_cs_A), RL78::CS)
            .addReg(RL78::R1);
        NumBytes -= 2;
        unsigned CFIIndex = MF.addFrameInst(
            MCCFIInstruction::cfiDefCfaOffset(nullptr, -NumBytes - 4));
        BuildMI(MBB, MBBI, dl, TII.get(TargetOpcode::CFI_INSTRUCTION))
            .addCFIIndex(CFIIndex);
      }
    }

    if (!Bank) {
      for (unsigned reg = 4; reg > 0; --reg) {
        if ((1 << (reg - 1)) & mask) {
          BuildMI(MBB, MBBI, dl, TII.get(RL78::POP_rp),
                  RL78::RP0 + ((reg - 1) % 4));
          NumBytes -= 2;
          unsigned CFIIndex = MF.addFrameInst(
              MCCFIInstruction::cfiDefCfaOffset(nullptr, -NumBytes - 4));
          BuildMI(MBB, MBBI, dl, TII.get(TargetOpcode::CFI_INSTRUCTION))
              .addCFIIndex(CFIIndex);
        }
      }
    }
  }
}

bool RL78FrameLowering::hasReservedCallFrame(const MachineFunction &MF) const {
  // Reserve call frame if there are no variable sized objects on the stack.
  return !MF.getFrameInfo().hasVarSizedObjects();
}

// hasFP - Return true if the specified function should have a dedicated frame
// pointer register.  This is true if the function has variable sized allocas or
// if frame pointer elimination is disabled.
bool RL78FrameLowering::hasFP(const MachineFunction &MF) const {
  const MachineFrameInfo &MFI = MF.getFrameInfo();
  return MFI.hasVarSizedObjects();
}

StackOffset
RL78FrameLowering::getFrameIndexReference(const MachineFunction &MF, int FI,
                                          Register &FrameReg) const {
  const RL78Subtarget &Subtarget = MF.getSubtarget<RL78Subtarget>();
  const MachineFrameInfo &MFI = MF.getFrameInfo();
  const RL78RegisterInfo *RegInfo = Subtarget.getRegisterInfo();

  bool flag = false;
  int64_t FrameOffset = MFI.getObjectOffset(FI);
  auto stackSize = MFI.getStackSize();
  if ((FI < 0) && (FrameOffset >= 0))
    FrameReg = RL78::SPreg;
  // ToDo: Fix
  // else if (RegInfo->needsStackRealignment(MF) && (FI < 0))
  else if (flag)
    // References to passed parameters need to load the old SP first.
    FrameReg = RL78::RP4;
  else
    FrameReg = RegInfo->getFrameRegister(MF);

  if (FI < 0) {
    // The return address is a special case.
    if (FrameOffset == -2)
      FrameOffset = stackSize;
    else if (FrameOffset < 0)
      FrameOffset = stackSize - FrameOffset;
    if (FrameReg == RL78::RP4)
      FrameOffset += 2;
  }
  // ToDo: Fix
  return StackOffset::getFixed(FrameOffset);
}

bool RL78FrameLowering::isLeafProc(MachineFunction &MF) const {
  MachineFrameInfo &MFI = MF.getFrameInfo();

  return !(MFI.hasCalls() // has calls
           || hasFP(MF)); // need FP
}

namespace {
// Struct used by orderFrameObjects to help sort the stack objects.
struct RL78FrameSortingObject {
  bool IsValid = false;       // true if we care about this Object.
  unsigned ObjectIndex = 0;   // Index of Object into MFI list.
  unsigned ObjectNumUses = 0; // Object static number of uses.
};

struct RL78FrameSortingComparator {
  inline bool operator()(const RL78FrameSortingObject &A,
                         const RL78FrameSortingObject &B) {
    // For consistency in our comparison, all invalid objects are placed
    // at the end. This also allows us to stop walking when we hit the
    // first invalid item after it's all sorted.
    if (!A.IsValid)
      return false;
    if (!B.IsValid)
      return true;

