ksekimoto/llvm-project/llvm/lib/Target/RL78/RL78FrameLowering.cpp
    return A.ObjectNumUses > B.ObjectNumUses;
  }
};
} // namespace

// Order frame objects:
// We want to place the more freequently used objects first (lower address)
// becuase we use [SP+offset] when offset < 256 and offset[BC] when offset >=
// 256. This will improve both code size and speed.
void RL78FrameLowering::orderFrameObjects(
    const MachineFunction &MF, SmallVectorImpl<int> &objectsToAllocate) const {
  const MachineFrameInfo &MFI = MF.getFrameInfo();

  // Don't waste time if there's nothing to do.
  if (objectsToAllocate.empty())
    return;

  // Create an array of all MFI objects. We won't need all of these
  // objects, but we're going to create a full array of them to make
  // it easier to index into when we're counting "uses" down below.
  // We want to be able to easily/cheaply access an object by simply
  // indexing into it, instead of having to search for it every time.
  std::vector<RL78FrameSortingObject> SortingObjects(MFI.getObjectIndexEnd());

  // Walk the objects we care about and mark them as such in our working
  // struct.
  int ObjectsSize = 0;
  for (auto &Obj : objectsToAllocate) {
    SortingObjects[Obj].IsValid = true;
    SortingObjects[Obj].ObjectIndex = Obj;
    ObjectsSize += MFI.getObjectSize(Obj);
  }

  if (ObjectsSize < 256)
    return;

  // Count the number of uses for each object.
  for (auto &MBB : MF) {
    for (auto &MI : MBB) {
      if (MI.isDebugInstr())
        continue;
      for (const MachineOperand &MO : MI.operands()) {
        // Check to see if it's a local stack symbol.
        if (!MO.isFI())
          continue;
        int Index = MO.getIndex();
        // Check to see if it falls within our range, and is tagged
        // to require ordering.
        if (Index >= 0 && Index < MFI.getObjectIndexEnd())
          SortingObjects[Index].ObjectNumUses++;
      }
    }
  }
  // Sort the objects using X86FrameSortingAlgorithm (see its comment for
  // info).
  llvm::stable_sort(SortingObjects, RL78FrameSortingComparator());

  // Now modify the original list to represent the final order that
  // we want.
  int i = 0;
  for (auto &Obj : SortingObjects) {
    // All invalid items are sorted at the end, so it's safe to stop.
    if (!Obj.IsValid)
      break;
    objectsToAllocate[i++] = Obj.ObjectIndex;
  }
}
